# Updating Row and columns

In [2]:
people = {
    "first": ['Ram', 'Sita', 'Arjun'],
    "last" : ['Mishra', 'Sharma', 'Rampal'],
    "email" :['ram@gmail.com', 'sita@gmail.com', 'arjun@gmail.com']
}

In [3]:
people

{'first': ['Ram', 'Sita', 'Arjun'],
 'last': ['Mishra', 'Sharma', 'Rampal'],
 'email': ['ram@gmail.com', 'sita@gmail.com', 'arjun@gmail.com']}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)
df

   first    last            email
0    Ram  Mishra    ram@gmail.com
1   Sita  Sharma   sita@gmail.com
2  Arjun  Rampal  arjun@gmail.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [12]:
#rename coolumns
df.columns = ['First Name', 'Last Name', 'Email']

In [13]:
df

  First Name Last Name            Email
0        Ram    Mishra    ram@gmail.com
1       Sita    Sharma   sita@gmail.com
2      Arjun    Rampal  arjun@gmail.com

In [14]:
#if u want to change into upper case
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME            EMAIL
0        Ram    Mishra    ram@gmail.com
1       Sita    Sharma   sita@gmail.com
2      Arjun    Rampal  arjun@gmail.com

In [16]:
#remove spaces in column name with undersocre
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME            EMAIL
0        Ram    Mishra    ram@gmail.com
1       Sita    Sharma   sita@gmail.com
2      Arjun    Rampal  arjun@gmail.com

In [17]:
#change into lower
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name            email
0        Ram    Mishra    ram@gmail.com
1       Sita    Sharma   sita@gmail.com
2      Arjun    Rampal  arjun@gmail.com

In [20]:
#change the part of string of a column
df.rename(columns = {'first_name': 'first', 'last_name':'last'}, inplace = True)

In [21]:
df

   first    last            email
0    Ram  Mishra    ram@gmail.com
1   Sita  Sharma   sita@gmail.com
2  Arjun  Rampal  arjun@gmail.com

#### updating data in rows

In [23]:
df.loc[2]

first              Arjun
last              Rampal
email    arjun@gmail.com
Name: 2, dtype: object